__author__ = 'dashik'

# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

Num = input('Введите номер буквы латинского алфавита ')
Alf = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w',
       'x', 'y', 'z']
print(Alf[int(Num) - 1])
