__author__ = 'dashik'
# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

A = input("Введите трехзначное число")
B = int(A[0]) + int(A[1]) + int(A[2])
C = int(A[0]) * int(A[1]) * int(A[2])
print(A)
print(B)
print(C)
